{
  "main": {
    "name": "Shashank Kotturi",
    "occupation": "Product Manager",
    "description": "I studied Computer Engineering at the University of Waterloo and I currently work at Cision",
    "image": "profilepic.jpg",
    "bio": "Currently, I work as a Product Manager at Cision to deliver new data products and experiences to customers. Further, I work on improving data quality for influencer profiles through automation. Previously, I worked as a Product Management Intern at Zighra, SAP and Flashfood. I have also worked on a side project called Sportdle. My hobbies include biking & exploring new trails, travelling around Canada & the US, and collecting coins in different denominations.",
    "contactmessage": "",
    "email": "shashankkotturi@outlook.com",
    "phone": "604-600-5956",
    "address": {
      "city": "Maple Ridge, BC",
      "state": "British Columbia"
    },
    "website": "https://medium.com/@shashankkotturi",
    "resumedownload": "https://flowcv.me/shashank",
    "social": [
      {
        "name": "email",
        "url": "mailto:shashankkotturi@outlook.com",
        "className": "fa fa-envelope"
      },
      {
        "name": "phone",
        "url": "tel:604-600-5956",
        "className": "fa fa-phone"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/shashank-kotturi/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/shashankkotturi",
        "className": "fa fa-github"
      },
      {
        "name": "medium",
        "url": "https://medium.com/@shashankkotturi",
        "className": "fa fa-external-link"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "University of California, Berkeley",
        "degree": "Master of Information and Cybersecurity (Candidate)",
        "graduated": "August 2024",
        "description": "Master core technical skills and become fluent in the business, political, and legal context of cybersecurity."
      },
      {
        "school": "University of Waterloo",
        "degree": "Bachelor of Applied Science (B.A.Sc.), Computer Engineering",
        "graduated": "October 2021",
        "description": "Relevant Courses: Engineering Design and Economics, Databases (MySQL), Algorithms and Data Structures (C++)"
      },
      {
        "school": "Scrum Alliance, Inc.",
        "degree": "Certified Scrum Product Owner",
        "graduated": "July 2022",
        "description": "The Certified Scrum Product Owner® (CSPO®) demonstrates knowledge and ability to maximize the value of a product."
      },
      {
        "school": "LinkedIn Learning",
        "degree": "Becoming a Product Manager",
        "graduated": "February 2020",
        "description": "LinkedIn Learning course that describes the role and skills that product managers posses in the workplace."
      },
      {
        "school": "PMI course - LinkedIn Learning",
        "degree": "Project Management Foundations",
        "graduated": "August 2019",
        "description": "Registered PMI course that describes the responsibilities of a project manager and the differences between a product and a project manager."
      },
      {
        "school": "Coursera",
        "degree": "Google Project Management Certification",
        "graduated": "In Progress",
        "description": "To understand project management and how it can have a positive impact on my daily activities as a product manager"
      }
    ],
    "work": [
      {
        "company": "Cision Ltd.",
        "title": "Product Manager",
        "years": "Oct 2022 - Present",
        "description": "Developed new smart search features through federated GraphQL by leveraging 5M relationships between 300k influencers, 200k outlets and 1M articles in a graph database. Established a new strategy to develop a Unified Product API with federated GraphQL to develop unique industry-leading products around analytics, insights and recommendations."
      },
      {
        "company": "Cision Ltd.",
        "title": "Product Manager",
        "years": "July 2022 - Sept 2022",
        "description": "Designed an automation strategy to verify 700k emails and prove 99.4% success rates. Doubled database to 600k journalists by identifying relevant attributes in a Twitter handle using named entity recognition, transformer models, and other machine learning processes. Led a cross-functional team of 20 engineers and business stakeholders to deploy a $5M database solution and increased efficiency by 40% through new features after go-live."
      },
      {
        "company": "Cision Ltd.",
        "title": "Associate Product Manager",
        "years": "May 2021 - July 2022",
        "description": "Developing and implementing an 18-month roadmap to transform and scale database size by 5x using automation, machine learning, and AI. Implemented machine learning strategies that conduct topic and entity extraction on 200M articles and 500k journalist profiles by coordinating with research and data science."
      },
      {
        "company": "Zighra Inc.",
        "title": "Product Management Intern",
        "years": "September 2020 - December 2020",
        "description": "Developed a Figma prototype with 20 UI components and increased client feedback by 20% by adding frames with actions that allows clients to interact with the prototype. Won a small business grant worth $50,000 by designing plans for in-app accessibility features. Deployed iOS and Android mobile apps in under 5 iterations by collaborating with app store partners to meet cross-functional rules related to business, technology and privacy."
      },
      {
        "company": "SAP Canada",
        "title": "Product Management Intern",
        "years": "January 2020 - April 2020",
        "description": "Published 11 video tutorials with 30 SQL scripts; Created 4 internal and external product roadmaps in JIRA and Confluence; Presented competitive analysis on 5 data virtualization platforms in the market to executive leadership."
      },
      {
        "company": "Flashfood",
        "title": "Product Management Intern",
        "years": "May 2019 - August 2019",
        "description": "Cut customer tickets by 40%, costs by 25% and customer wait time by 2 days by redesigning customer support system; Proposed migrating in app event tracking from Mixpanel to Amplitude to reduce annual costs by $100,000."
      },
      {
        "company": "Telus",
        "title": "Full Stack Developer Intern",
        "years": "September 2018 - December 2018",
        "description": "Designed 5 wireframes and created functional prototype for small businesses to customize 10 internet packages with over 20 options each; Eliminated 20% of internal API calls and reduced 30% of Express server usage."
      }
    ],
    "skillmessage": "I believe that a Product Manager requires a combination of soft and technical skills (tools, languages and frameworks) to succeed in their role. So, here's a look at some of the skills I've acquired from my previous experiences.",
    "skills": [      
      {
        "name": "Product Strategy",
        "level": "70%"
      },
      {
        "name": "Product Analytics",
        "level": "70%"
      },
      {
        "name": "Communication",
        "level": "80%"
      },
      {
        "name": "Project Management",
        "level": "60%"
      },
      {
        "name": "Prototyping",
        "level": "75%"
      },
      {
        "name": "Data Driven",
        "level": "75%"
      }
    ],
    "projectmanagement": [
      {
        "name": "JIRA, Confluence",
        "level": "90%"
      },
      {
        "name": "ProductBoard",
        "level": "90%"
      },
      {
        "name": "Miro",
        "level": "85%"
      }     
    ],
    "prototyping": [
      {
        "name": "Figma",
        "level": "90%"
      },
      {
        "name": "Webflow",
        "level": "80%"
      },
      {
        "name": "Zapier",
        "level": "70%"
      }
    ],
    "productanalytics": [
      {
        "name": "Google Analytics",
        "level": "60%"
      },
      {
        "name": "Mixpanel",
        "level": "50%"
      },
      {
        "name": "QuickSight",
        "level": "65%"
      }
    ],
    "datadriven": [
      {
        "name": "SQL",
        "level": "70%"
      },
      {
        "name": "Excel",
        "level": "80%"
      },      
      {
        "name": "Python",
        "level": "70%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Sportdle: A musical version of Wordle",
        "category": " Built using React, Express and Spotify Web APIs. Deployed on Heroku via GitHub.",
        "image": "",
        "url": "https://sportdle-react.herokuapp.com/",
        "description": "Inspired by Wordle, I've developed an app that tests how well you know your playlists. This project is still a POC in development phase but can be updated with many more features for a MVP."

      },
      {
        "title": "Making Relationships with Technology",
        "category": "An app that provides helpful tips to create and maintain meaningful relationships.",
        "image": "",
        "url": "https://medium.com/@shashankkotturi/making-relationships-with-technology-a1f8f0684925",
        "description": "This app is designed to help people start and maintain meaningful relationships. I am currently working with a friend to develop a business strategy and POC to provide an end-to-end solution for relationship management. Features include personalized profile matching, recommendations on topics to chat about, in-app gift purchasing, reminders for special occasions, and more."
      },
      {
        "title": "FoodSaver - Capstone Project Idea",
        "category": "An inventory management tool for perishable items to reduce food waste in stores.",
        "image": "",
        "url": "",
        "description": "The FoodSaver project keeps track of item expiry and location within a store. Store managers will be notified of items that are about to expire such that the items can be sold for a reduced price instead of being thrown out. This project improves inventory management, reduces logistical costs of transporting waste, avoids food waste taxes and drives foot traffic into stores."
      },
      {
        "title": "Spotify Headphones - Capstone Project Idea",
        "category": "A pair of headphones that can function independently without an external device.",
        "image": "",
        "url": "",
        "description": "The Spotify Headphones idea involves developing a pair of over-ear headphones that can store music on the device, rather than relying on Bluetooth to transmit data. This allows users to listen to music without carrying an external device such as a phone or a smartwatch. This project aims to serve fitness enthusiasts that workout in a gym or go for long runs."
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Shashank was an outstanding co-op. He bettered the company and really took initiative to help out where-ever he could. He worked on items that lowered overhead costs of the business and they've been successfully used in production. Shashank has been a great teammate to the Flashfood team and we would highly recommend him for future co-op positions. We would be glad to have him back in the future if something lines up.",
        "user": "Stephanie Nguyen, VP, Product & Design, Flashfood"
      },
      {
        "text": "Shashank has proven to be adaptable to changing circumstances, both within SAP and during the COVID-19 issues that have occurred during the term.  He is very reliable, and works independently, as was shown throughout the term, and especially when he began to work from home locally, and then remotely when he moved back to be with his family.  He was a good team-member, interacting and asking questions when he was not clear on a task or when he needed help. As he settled in over the term, he became more proactive in pursuing his assigned tasks, setting meetings to solicit feedback and discuss progress.",
        "user": "Jason Hinsperger, Sr. Product Manager, SAP Canada"
      }
    ]
  },
  "ideas": {
    "ideas": [
      {
        "title": "Making relationships with technology",
        "url": "https://medium.com/@shashankkotturi/making-relationships-with-technology-a1f8f0684925"
      },
      {
        "title": "Why can I not stream YouTube or any other videos in my car?",
        "url": "https://medium.com/@shashankkotturi/why-can-i-not-stream-youtube-or-any-other-videos-in-my-car-b13b4d9af70c"
      },
      {
        "title": "Viewing social media activity within Spotify",
        "url": "https://medium.com/@shashankkotturi/viewing-social-media-activity-within-spotify-f183f5e1f526"
      }
    ]
  }
}